membership-common/src/test/resources/rest/SupporterDiscountUat.json

{
  "success": true,
  "id": "2c92c0f857db5bf20157dd3417fb4c3b",
  "accountId": "2c92c0f857db5bf20157dd3417d54c38",
  "accountNumber": "A00064591",
  "accountName": "001g000001OQCGxAAP",
  "subscriptionNumber": "A-S00064677",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2016-10-19",
  "serviceActivationDate": "2016-10-19",
  "customerAcceptanceDate": "2016-10-19",
  "subscriptionStartDate": "2016-10-19",
  "termStartDate": "2016-10-19",
  "termEndDate": "2017-10-19",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 4.08,
  "totalContractedValue": 49,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "QuoteNumber__QT": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "OpportunityName__QT": null,
  "GiftSubscription__c": "No",
  "TrialPeriodDays__c": null,
  "ActivationDate__c": null,
  "OpportunityCloseDate__QT": null,
  "GiftSerialNumber__c": null,
  "CASSubscriberID__c": null,
  "IPaddress__c": null,
  "Suspended__c": "false",
  "CpqBundleJsonId__QT": null,
  "PromotionCode__c": "john2016",
  "QuoteType__QT": null,
  "OriginalSubscriptionStartDate__c": null,
  "ratePlans": [
    {
      "id": "2c92c0f857db5bf20157dd3418114c3f",
      "productId": "2c92c0f853077d930153129952a50ef9",
      "productName": "Adjustments and Discounts",
      "productSku": "ABC-00000016",
      "productRatePlanId": "2c92c0f953078a5601531299dae54a4d",
      "ratePlanName": "Percentage",
      "ratePlanCharges": [
        {
          "id": "2c92c0f857db5bf20157dd3418174c40",
          "originalChargeId": "2c92c0f857db5bf20157dd3418174c40",
          "productRatePlanChargeId": "2c92c0f853077d930153129a91bd0f74",
          "number": "C-00127396",
          "name": "Percentage",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "pricingSummary": "25%  discount",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": null,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": 25,
          "discountAmount": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-10-19",
          "effectiveEndDate": "2017-10-19",
          "processedThroughDate": "2016-10-19",
          "chargedThroughDate": "2017-10-19",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Billing_Periods",
          "upToPeriods": 1,
          "specificEndDate": null,
          "mrr": 0,
          "dmrc": 0,
          "tcv": 0,
          "dtcv": 0,
          "description": "",
          "HolidayEnd__c": null
        }
      ],
      "subscriptionProductFeatures": []
    },
    {
      "id": "2c92c0f857db5bf20157dd34182b4c44",
      "productId": "2c92c0f84bbfeca5014bc0c5a793241d",
      "productName": "Supporter",
      "productSku": "SKU-00000013",
      "productRatePlanId": "2c92c0f84c5100b6014c569b83b33ebd",
      "ratePlanName": "Non Founder Supporter - annual",
      "ratePlanCharges": [
        {
          "id": "2c92c0f857db5bf20157dd3418334c45",
          "originalChargeId": "2c92c0f857db5bf20157dd3418334c45",
          "productRatePlanChargeId": "2c92c0f84c5100b6014c569b83c23ebf",
          "number": "C-00127397",
          "name": "Non Founder Supporter - Annual",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP49",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 49,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-10-19",
          "effectiveEndDate": "2017-10-19",
          "processedThroughDate": "2016-10-19",
          "chargedThroughDate": "2017-10-19",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 4.083333333,
          "dmrc": 4.083333333,
          "tcv": 49,
          "dtcv": 49,
          "description": "",
          "HolidayEnd__c": null
        }
      ],
      "subscriptionProductFeatures": []
    }
  ]
}